================================================================================
attribute id
================================================================================
[]{#id}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (id_specifier))))
================================================================================
attribute class
================================================================================
[]{.class}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (class_specifier))))
================================================================================
empty attribute
================================================================================
[]{}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute)))
================================================================================
attribute two classes with spaces
================================================================================
[]{.class1 .class2}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (class_specifier)
      (class_specifier))))
================================================================================
attribute class with period in the name
================================================================================
[]{.class1.class2}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (class_specifier))))
================================================================================
attribute key-value
================================================================================
[]{k=v}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (key_value_specifier
        (key_value_key)
        (key_value_value)))))
================================================================================
attribute key-value
================================================================================
[]{k="v"}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (key_value_specifier
        (key_value_key)
        (key_value_value)))))

================================================================================
attribute 2 key-values
================================================================================
[]{k="v"k2="v2"}
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (key_value_specifier
        (key_value_key)
        (key_value_value))
      (key_value_specifier
        (key_value_key)
        (key_value_value)))))
================================================================================
attribute 2 key-values with spaces
================================================================================
[]{ k="v" k2="v2" }
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (key_value_specifier
       (key_value_key)
       (key_value_value))
      (key_value_specifier
        (key_value_key)
        (key_value_value)))))
================================================================================
attribute key-values with escaped quote in value
(NB: the tree-sitter test infra wants the backslash in this file to be escaped)
================================================================================
[]{ k2="v\\"2" }
--------------------------------------------------------------------------------
(inline
  (inline_link
    (commonmark_attribute
      (key_value_specifier
       (key_value_key)
       (key_value_value)))))