================================================================================
basic suppress author
================================================================================
-@hello
--------------------------------------------------------------------------------
(inline
  (citation
    (citation_delimiter)
    (citation_id_suppress_author)))
================================================================================
basic author in text
================================================================================
@hello
--------------------------------------------------------------------------------
(inline
  (citation
    (citation_delimiter)
    (citation_id_author_in_text)))
================================================================================
basic author in text with brackets
================================================================================
@{https://example.com}
--------------------------------------------------------------------------------
(inline
  (citation
    (citation_delimiter)
    (citation_id_author_in_text_with_brackets)
    (citation_delimiter)))
================================================================================
basic suppress author with brackets
================================================================================
-@{https://example.com}
--------------------------------------------------------------------------------
(inline
  (citation
    (citation_delimiter)
    (citation_id_suppress_author_with_brackets)
    (citation_delimiter)))